## Exkurs: Pandas (DataFrame)

In [16]:
import sqlite3

conn = sqlite3.connect("./database.sqlite")

In [17]:
import pandas as pd

df = pd.read_sql("SELECT * FROM students", conn)

In [22]:
df.head()

   id firstname     surname     subject  semester
0   1    Monika  Mustermann  Informatik         3
1   2       Max      Müller       Mathe         2
2   3     Erika      Müller         BWL         5
3   4     Laura  Mustermann       Mathe         2
4   5   Andreas     Schmidt  Informatik         4

In [23]:
df["firstname"]

0        Monika
1           Max
2         Erika
3         Laura
4       Andreas
5    Maximilian
6        Moritz
Name: firstname, dtype: object

In [24]:
for col in df:
    print(col)

id
firstname
surname
subject
semester

In [32]:
df.head()

   id firstname     surname     subject  semester
0   1    Monika  Mustermann  Informatik         3
1   2       Max      Müller       Mathe         2
2   3     Erika      Müller         BWL         5
3   4     Laura  Mustermann       Mathe         2
4   5   Andreas     Schmidt  Informatik         4

In [35]:
for key, item in df.iterrows():
    print(item["firstname"] + " " + item["surname"])

Monika Mustermann
Max Müller
Erika Müller
Laura Mustermann
Andreas Schmidt
Maximilian Schneider
Moritz Fischer